<a href="https://colab.research.google.com/github/veranika-izrailyan/python_practice/blob/main/04_TextAnalysisRegex.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Exploratory Text Analysis

## What kinds of text analysis are there?

* analyst knows the pattern
    * regular expressions
* analyst does not know the pattern
    * natural language processing
        * compares historical examples to judge novel cases
            * comparisons are statistical and approximate

### Examples of Analysis

When you know the pattern:

In [1]:
pattern = '£ ?[0-9][0-9]?' # £ then SPACE-optional then digit then digit-optional 

document = 'My eggs cost £3, bread cost £2, vodka cost £35'

In [2]:
import re

In [3]:
re.findall(pattern, document)

['£3', '£2', '£35']

If you dont:

* sentiment analysis
    * how positive/negative is this (new) review?
* topic analysis 
    * what is this document about?

## What can I do if I know what pattern I want to find?

* finding ("extracting")
    * what matches the pattern?
* matching ("validating")
    * does the entire document match YES/NO?
* substitue ("replacing")
    * replace a part that matches a pattern with another...

## How do I validate text with pandas?

In [4]:
import pandas as pd

In [5]:
ti = pd.read_csv('datasets/titanic.csv')
ti.sample(1)

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
558         1       1  female  39.0  ...     E  Southampton    yes  False

[1 rows x 15 columns]

In [6]:
ti['ticket'] = "Ticket: " + ti['class'] + "; Price: $ " + ti['fare'].astype(str) + "; Port: " + ti['embark_town'] + ";"

In [7]:
ti[['class', 'fare', 'embark_town', 'ticket']].head(3)

   class  ...                                             ticket
0  Third  ...   Ticket: Third; Price: $ 7.25; Port: Southampton;
1  First  ...  Ticket: First; Price: $ 71.2833; Port: Cherbourg;
2  Third  ...  Ticket: Third; Price: $ 7.925; Port: Southampton;

[3 rows x 4 columns]

In [8]:
pattern = '(First|Second)'

ti['class'].str.match(pattern)

0      False
1       True
2      False
3       True
4      False
       ...
886     True
887     True
888    False
889     True
890    False
Name: class, Length: 891, dtype: bool

In [9]:
ti.loc[ ti['class'].str.match(pattern)  , 'survived'].mean()

0.5575

## How do I extract data with pandas?

In [10]:
ti[['class', 'fare', 'embark_town', 'ticket']].head(3)

   class  ...                                             ticket
0  Third  ...   Ticket: Third; Price: $ 7.25; Port: Southampton;
1  First  ...  Ticket: First; Price: $ 71.2833; Port: Cherbourg;
2  Third  ...  Ticket: Third; Price: $ 7.925; Port: Southampton;

[3 rows x 4 columns]

In [12]:
pattern = '([0-9.]+)'

ti['ticket'].str.extract(pattern).sample(10)

           0
638  39.6875
702  14.4542
672     10.5
797   8.6833
739   7.8958
588     8.05
223   7.8958
385     73.5
697   7.7333
279    20.25

## How do I substitue text with pandas?

In [14]:
ti['ticket'].str.replace('$', '€').sample(10)

443    Ticket: Second; Price: € 13.0; Port: Southampton;
393    Ticket: First; Price: € 113.275; Port: Cherbourg;
160     Ticket: Third; Price: € 16.1; Port: Southampton;
560      Ticket: Third; Price: € 7.75; Port: Queenstown;
545     Ticket: First; Price: € 26.0; Port: Southampton;
808    Ticket: Second; Price: € 13.0; Port: Southampton;
351     Ticket: First; Price: € 35.0; Port: Southampton;
277     Ticket: Second; Price: € 0.0; Port: Southampton;
352     Ticket: Third; Price: € 7.2292; Port: Cherbourg;
479    Ticket: Third; Price: € 12.2875; Port: Southam...
Name: ticket, dtype: object

## What are regular expressions?

Regular expressions are a language for describing patterns in text. 

They are separate from python, but may be used within python program. (And elsewhere, eg., often in SQL). 

They are notoriously difficult to read and write; and as a separate language, an additional tool to learn.

## What regular expression patterns can I use?

* literals
    * `a`, find me an `a`
    * `£`, find `£`
    * `!` means `!` 
    * ... most symbols mean "find me"
* `.`
    * find any **single** symbol 
* character classes -- find a **single** symbol
    * `[abc]` $\rightarrow$ **either** a, b, c
    * `[0-9]` $\rightarrow$ **either** 0, 1, 2, 3,...9
    * `[A-Z]` $\rightarrow$ **either** capital A, B, ... Z
    * inversions
        * `[^abc]` $\rightarrow$ **is not** `a` OR `b` OR `c`
        * `[^a-zA-Z0-9 ]`  $\rightarrow$ **is not** alphanumeric-ish
    
* alternatives -- find the character**s** given by...
    * `(May|June|July)`  $\rightarrow$ **the whole worlds** May OR June..

In [15]:
ti['ticket'].str.extract('(Ticket: (First|Second))')

                  0       1
0               NaN     NaN
1     Ticket: First   First
2               NaN     NaN
3     Ticket: First   First
4               NaN     NaN
..              ...     ...
886  Ticket: Second  Second
887   Ticket: First   First
888             NaN     NaN
889   Ticket: First   First
890             NaN     NaN

[891 rows x 2 columns]

In [16]:
ti['ticket'].str.extract('( [0-9][0-9])')

       0
0    NaN
1     71
2    NaN
3     53
4    NaN
..   ...
886   13
887   30
888   23
889   30
890  NaN

[891 rows x 1 columns]

In [17]:
ti['ticket'].sample(1)

438    Ticket: First; Price: $ 263.0; Port: Southampton;
Name: ticket, dtype: object

In [18]:
ti['ticket'].str.extract('(Ticket: [A-Z])').sample(2)

             0
125  Ticket: T
536  Ticket: F

In [19]:
ti['ticket'].str.extract('(T........)').sample(3)

             0
649  Ticket: T
159  Ticket: T
672  Ticket: S

In [20]:
ti['ticket'].str.extract('(Price: [^0-9A-Za-z] ..)').sample(3)

               0
293  Price: $ 8.
687  Price: $ 10
31   Price: $ 14

In [21]:
ti['ticket'].str.extract('(Port: (Cherbourg|Southampton))').sample(3)

                   0          1
517              NaN        NaN
111  Port: Cherbourg  Cherbourg
44               NaN        NaN

* repetitions
    * optional `?`
        * an optional number: `[0-9]?`
    * one or more `+`
        * one or more spaces: ` +`  
    * optional, or more, `*`
        * ` [0-9][0-9]?.[0-9]*`

In [22]:
ti['ticket'].str.extract('([0-9][0-9]?.[0-9]*)').sample(3)

          0
843  6.4375
655    73.5
330   23.25

In [23]:
ti['ticket'].str.extract('(Ticket: [a-zA-Z]+)').sample(3)

                  0
688   Ticket: Third
603   Ticket: Third
854  Ticket: Second

In [24]:
row = 0
match = 1 # second match

ti['ticket'].str.extractall('([a-zA-Z]+: [a-zA-Z]+)').loc[row, match]

0    Port: Southampton
Name: (0, 1), dtype: object

In [25]:
ti['ticket'].str.extract('([a-zA-Z]+tow?n)')

               0
0    Southampton
1            NaN
2    Southampton
3    Southampton
4    Southampton
..           ...
886  Southampton
887  Southampton
888  Southampton
889          NaN
890   Queenstown

[891 rows x 1 columns]

* EXTRA: 
    * escaping
        * How do I say, literally, the `.` symbol?
        * `\.`

In [26]:
ti['ticket'].str.extract('(\$ [0-9]+\.[0-9]+)').sample(2)

            0
629  $ 7.7333
340    $ 26.0

* positional matching
    * `^` means **at the beginning**
    * `$` means **at the end**

In [27]:
ti['ticket'].str.extractall('([a-zA-Z]+: [a-zA-Z]+;$)').sample(1)

                            0
    match
131 0      Port: Southampton;

In [28]:
ti['ticket'].str.extractall('(^[a-zA-Z]+: [a-zA-Z]+;)').sample(1)

                         0
    match
518 0      Ticket: Second;

## Next Steps

* review a "Regex Cheat Sheet"
    * also, eg., https://en.wikipedia.org/wiki/Regular_expression#Examples

## Exercise (30 min)

* find all the words in the tickets 
    * HINT: a word is a repeated letter followed by a space or a colon
    * HINT: `[ :]` means a space or a colon
* find all the USD prices
    * HINT: ``` \$ ``` and repeated numbers 
    
* find all the high-price tickets
    * HINT: consider `\$`, tripple-digit number, `\.`

In [31]:
# Solution

In [30]:
ti['ticket'].str.findall('([a-zA-Z]+[ :])').sample(10)

476    [Ticket:, Price:, Port:]
671    [Ticket:, Price:, Port:]
432    [Ticket:, Price:, Port:]
703    [Ticket:, Price:, Port:]
538    [Ticket:, Price:, Port:]
845    [Ticket:, Price:, Port:]
687    [Ticket:, Price:, Port:]
479    [Ticket:, Price:, Port:]
737    [Ticket:, Price:, Port:]
765    [Ticket:, Price:, Port:]
Name: ticket, dtype: object

In [ ]:
ti['ticket'].str.extract('(\$ [0-9]+\.[0-9]+)').sample(2)

             0
644  $ 19.2583
790     $ 7.75

In [ ]:
row = 0
match = 1 # second match
ti['ticket'].str.extractall('(\$ [0-9][0-9][0-9]+\.[0-9]+)')#.loc[row, 0]

                    0
    match
27  0         $ 263.0
31  0      $ 146.5208
88  0         $ 263.0
118 0      $ 247.5208
195 0      $ 146.5208
215 0       $ 113.275
258 0      $ 512.3292
268 0      $ 153.4625
269 0      $ 135.6333
297 0        $ 151.55
299 0      $ 247.5208
305 0        $ 151.55
306 0      $ 110.8833
307 0         $ 108.9
311 0       $ 262.375
318 0      $ 164.8667
319 0         $ 134.5
325 0      $ 135.6333
332 0      $ 153.4625
334 0        $ 133.65
337 0         $ 134.5
341 0         $ 263.0
373 0      $ 135.6333
377 0         $ 211.5
380 0       $ 227.525
390 0         $ 120.0
393 0       $ 113.275
435 0         $ 120.0
438 0         $ 263.0
498 0        $ 151.55
505 0         $ 108.9
527 0      $ 221.7792
537 0       $ 106.425
544 0       $ 106.425
550 0      $ 110.8833
557 0       $ 227.525
581 0      $ 110.8833
609 0      $ 153.4625
659 0       $ 113.275
660 0        $ 133.65
679 0      $ 512.3292
689 0      $ 211.3375
698 0      $ 110.8833
700 0       $ 227.525
708 0        $ 151.55
716 0       $ 227.525
730 0      $ 211.3375
737 0      $ 512.3292
742 0       $ 262.375
763 0         $ 120.0
779 0      $ 211.3375
802 0         $ 120.0
856 0      $ 164.8667